## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # zentral_mdm_artifact.mscp-firewall will be created
  + resource "zentral_mdm_artifact" "mscp-firewall" {
      + auto_update                    = true
      + channel                        = "Device"
      + id                             = (known after apply)
      + install_during_setup_assistant = false
      + name                           = "mSCP - firewall"
      + platforms                      = [
          + "macOS",
        ]
      + reinstall_interval             = 0
      + reinstall_on_os_update         = "No"
      + requires                       = (known after apply)
      + type                           = "Profile"
    }

  # zentral_mdm_blueprint_artifact.mscp-firewall will be created
  + resource "zentral_mdm_blueprint_artifact" "mscp-firewall" {
      + artifact_id        = (known after apply)
      + blueprint_id       = 1
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
    }

  # zentral_mdm_profile.mscp-firewall-1 will be created
  + resource "zentral_mdm_profile" "mscp-firewall-1" {
      + artifact_id        = (known after apply)
      + default_shard      = 100
      + excluded_tag_ids   = []
      + id                 = (known after apply)
      + ios                = false
      + ios_max_version    = ""
      + ios_min_version    = ""
      + ipados             = false
      + ipados_max_version = ""
      + ipados_min_version = ""
      + macos              = true
      + macos_max_version  = ""
      + macos_min_version  = ""
      + shard_modulo       = 100
      + source             = "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxLjAiPgo8ZGljdD4KCTxrZXk+Q29uc2VudFRleHQ8L2tleT4KCTxkaWN0PgoJCTxrZXk+ZGVmYXVsdDwva2V5PgoJCTxzdHJpbmc+VEhFIFNPRlRXQVJFIElTIFBST1ZJREVEICdBUyBJUycgV0lUSE9VVCBBTlkgV0FSUkFOVFkgT0YgQU5ZIEtJTkQsIEVJVEhFUiBFWFBSRVNTRUQsIElNUExJRUQsIE9SIFNUQVRVVE9SWSwgSU5DTFVESU5HLCBCVVQgTk9UIExJTUlURUQgVE8sIEFOWSBXQVJSQU5UWSBUSEFUIFRIRSBTT0ZUV0FSRSBXSUxMIENPTkZPUk0gVE8gU1BFQ0lGSUNBVElPTlMsIEFOWSBJTVBMSUVEIFdBUlJBTlRJRVMgT0YgTUVSQ0hBTlRBQklMSVRZLCBGSVRORVNTIEZPUiBBIFBBUlRJQ1VMQVIgUFVSUE9TRSwgQU5EIEZSRUVET00gRlJPTSBJTkZSSU5HRU1FTlQsIEFORCBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgRE9DVU1FTlRBVElPTiBXSUxMIENPTkZPUk0gVE8gVEhFIFNPRlRXQVJFLCBPUiBBTlkgV0FSUkFOVFkgVEhBVCBUSEUgU09GVFdBUkUgV0lMTCBCRSBFUlJPUiBGUkVFLiAgSU4gTk8gRVZFTlQgU0hBTEwgTklTVCBCRSBMSUFCTEUgRk9SIEFOWSBEQU1BR0VTLCBJTkNMVURJTkcsIEJVVCBOT1QgTElNSVRFRCBUTywgRElSRUNULCBJTkRJUkVDVCwgU1BFQ0lBTCBPUiBDT05TRVFVRU5USUFMIERBTUFHRVMsIEFSSVNJTkcgT1VUIE9GLCBSRVNVTFRJTkcgRlJPTSwgT1IgSU4gQU5ZIFdBWSBDT05ORUNURUQgV0lUSCBUSElTIFNPRlRXQVJFLCBXSEVUSEVSIE9SIE5PVCBCQVNFRCBVUE9OIFdBUlJBTlRZLCBDT05UUkFDVCwgVE9SVCwgT1IgT1RIRVJXSVNFLCBXSEVUSEVSIE9SIE5PVCBJTkpVUlkgV0FTIFNVU1RBSU5FRCBCWSBQRVJTT05TIE9SIFBST1BFUlRZIE9SIE9USEVSV0lTRSwgQU5EIFdIRVRIRVIgT1IgTk9UIExPU1MgV0FTIFNVU1RBSU5FRCBGUk9NLCBPUiBBUk9TRSBPVVQgT0YgVEhFIFJFU1VMVFMgT0YsIE9SIFVTRSBPRiwgVEhFIFNPRlRXQVJFIE9SIFNFUlZJQ0VTIFBST1ZJREVEIEhFUkVVTkRFUi48L3N0cmluZz4KCTwvZGljdD4KCTxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KCTxhcnJheT4KCQk8ZGljdD4KCQkJPGtleT5FbmFibGVGaXJld2FsbDwva2V5PgoJCQk8dHJ1ZS8+CgkJCTxrZXk+RW5hYmxlTG9nZ2luZzwva2V5PgoJCQk8dHJ1ZS8+CgkJCTxrZXk+RW5hYmxlU3RlYWx0aE1vZGU8L2tleT4KCQkJPHRydWUvPgoJCQk8a2V5PkxvZ2dpbmdPcHRpb248L2tleT4KCQkJPHN0cmluZz5kZXRhaWw8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJCQk8c3RyaW5nPmFsYWNhcnRlLm1hY09TLmNpc19sdmwxLjIzMmE0NzRhLWQ0MjAtNDlkMi04ZDcyLTkzMGNjZTU2YjMyOTwvc3RyaW5nPgoJCQk8a2V5PlBheWxvYWRUeXBlPC9rZXk+CgkJCTxzdHJpbmc+Y29tLmFwcGxlLnNlY3VyaXR5LmZpcmV3YWxsPC9zdHJpbmc+CgkJCTxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KCQkJPHN0cmluZz4yMzJhNDc0YS1kNDIwLTQ5ZDItOGQ3Mi05MzBjY2U1NmIzMjk8L3N0cmluZz4KCQkJPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5PgoJCQk8aW50ZWdlcj4xPC9pbnRlZ2VyPgoJCTwvZGljdD4KCTwvYXJyYXk+Cgk8a2V5PlBheWxvYWREZXNjcmlwdGlvbjwva2V5PgoJPHN0cmluZz5DcmVhdGVkOiAyMDI0LTA3LTA5CkNvbmZpZ3VyYXRpb24gc2V0dGluZ3MgZm9yIHRoZSBjb20uYXBwbGUuc2VjdXJpdHkuZmlyZXdhbGwgcHJlZmVyZW5jZSBkb21haW4uPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWREaXNwbGF5TmFtZTwva2V5PgoJPHN0cmluZz5bY2lzX2x2bDFdIGNvbS5hcHBsZS5zZWN1cml0eS5maXJld2FsbCBzZXR0aW5nczwvc3RyaW5nPgoJPGtleT5QYXlsb2FkSWRlbnRpZmllcjwva2V5PgoJPHN0cmluZz5jb20uYXBwbGUuc2VjdXJpdHkuZmlyZXdhbGwuY2lzX2x2bDE8L3N0cmluZz4KCTxrZXk+UGF5bG9hZE9yZ2FuaXphdGlvbjwva2V5PgoJPHN0cmluZz5tYWNPUyBTZWN1cml0eSBDb21wbGlhbmNlIFByb2plY3Q8L3N0cmluZz4KCTxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+Cgk8c3RyaW5nPlN5c3RlbTwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVHlwZTwva2V5PgoJPHN0cmluZz5Db25maWd1cmF0aW9uPC9zdHJpbmc+Cgk8a2V5PlBheWxvYWRVVUlEPC9rZXk+Cgk8c3RyaW5nPjlmYzlmYTcyLTA1OTUtNDI0Ni1hZWM0LTY5YmMyZGZmODVjNDwvc3RyaW5nPgoJPGtleT5QYXlsb2FkVmVyc2lvbjwva2V5PgoJPGludGVnZXI+MTwvaW50ZWdlcj4KPC9kaWN0Pgo8L3BsaXN0Pgo="
      + tag_shards         = []
      + tvos               = false
      + tvos_max_version   = ""
      + tvos_min_version   = ""
      + version            = 1
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>